STMicroelectronics/STM32CubeG0/Projects/STM32G081B-EVAL/Applications/USB-PD/USB-PD_Consumer_1port/Src/usbpd_pwr_user.c
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file    usbpd_pwr_user.c
  * @author  MCD Application Team
  * @brief   USBPD PWR user code
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2018 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */
/* USER CODE END Header */

/* Includes ------------------------------------------------------------------*/
#include "usbpd_pwr_user.h"
#include "stm32g0xx_hal.h"
#if defined(_TRACE)
#include "usbpd_core.h"
#include "usbpd_trace.h"
#endif /* _TRACE */

/* USER CODE BEGIN include */
#include "stm32g0xx_ll_lptim.h"
#if defined(_TRACE)
#include "stdio.h"
#include "string.h"
#endif /* _TRACE */
/* USER CODE END include */

/** @addtogroup BSP
  * @{
  */

/** @addtogroup POWER
  * @{
  */
/** @defgroup POWER_Private_Typedef Private Typedef
  * @{
  */
/* USER CODE BEGIN POWER_Private_Typedef */
/* Vref voltage level (in mV) */
#define VREFANALOG_VOLTAGE 3300

/**
  * @brief USB PD PPS values
  */
typedef enum
{
  VBUS_5_V         = 0,
  VBUS_9_V         = 1,
  VBUS_15_V        = 2,
  VBUS_18_V        = 3,
  VBUS_PPS_V       = 4,
  VBUS_LEVEL_NB    = 5
} VBUS_Level_TypeDef;

typedef enum
{
    ADC_VSENSE_1       = 0,   /*< PB1  ADC used to get VBUS1 voltage level     */
    ADC_ISENSE_1       = 1,   /*< PB10 ADC used to get VBUS1 curent value      */
    ADC_VSENSE_2       = 2,   /*< PA3  ADC used to get VBUS2 voltage level     */
    ADC_ISENSE_2       = 3,   /*< PB12 ADC used to get VBUS2 curent value      */
    ADC_VSENSE_DCDC    = 4    /*< PB11 ADC used to get DCDC voltage level      */
} ADC_ChannelId_TypeDef;

typedef enum
{
    GPIO_SOURCE_EN        = 0,   /*< PC6  Handle Source power Mos                                    */
    GPIO_VBUS_DISCHARGE1  = 1,   /*< PB13 Handle Discharge Mos on VBUS1                              */
    GPIO_VBUS_DISCHARGE2  = 2,   /*< PB14 Handle Discharge Mos on VBUS2                              */
    GPIO_VCONN_EN1        = 3,   /*< PD4  Handle Vconn on VBUS1                                      */
    GPIO_VCONN_EN2        = 4,   /*< PB9  Handle Vconn on VBUS2                                      */
    GPIO_VCONN_DISCHARGE1 = 5,   /*< PA2  Handle Fast Role Swap on VBUS1 CC1 line or Vconn Discharge */
    GPIO_VCONN_DISCHARGE2 = 6,   /*< PPB0 Handle Fast Role Swap on VBUS1 CC2 line or Vconn Discharge */
    GPIO_V_CTL1           = 7,   /*< PC1   VBUS voltage level control                                */
    GPIO_V_CTL2           = 8    /*< PB5 (Rev. A/B) or PA1 (Rev. C) VBUS voltage level control       */
} GPIO_Id_TypeDef;

typedef enum {
    PORT_NOT_INITIALIZED = 0,
    PORT_INITIALIZED
} PWR_PortStateTypedef;

typedef enum {
  POWER_NONE,
  POWER_FIXED,
  POWER_VARIABLE,
  POWER_APDO
} PWR_Type;


typedef struct {
    PWR_PortStateTypedef            State;
    PWR_PowerRoleTypeDef            Role;
    uint32_t                        VBUSDisconnectionThreshold;
    PWR_VBUSConnectionStatusTypeDef VBUSConnectionStatus;
    PWR_VBUSDetectCallbackFunc *    pfnVBUSDetectCallback;
    PWR_Type                        Type;
    uint32_t                        VBUSVoltage;
} PortInfoTypeDef;


typedef struct {
    uint8_t                         ADCRefCount;
    PWR_DCDCCtrlModeTypeDef         DCDCCtrlMode;
    PortInfoTypeDef                 PortInfo[PWR_TYPEC_PORT_NB];
} ContextTypeDef;

/* USER CODE END POWER_Private_Typedef */
/**
  * @}
  */

/** @defgroup POWER_Private_Constants Private Constants
* @{
*/
/* USER CODE BEGIN POWER_Private_Constants */
#define GPIO_SOURCE_EN_PIN                    GPIO_PIN_3  /* PD.03 */
#define GPIO_SOURCE_EN_PORT                   GPIOD
#define GPIO_SOURCE_EN_CLK_ENABLE()           __HAL_RCC_GPIOD_CLK_ENABLE()

#define GPIO_VBUS_DISCHARGE1_PIN              GPIO_PIN_13  /* PB.13 */
#define GPIO_VBUS_DISCHARGE1_PORT             GPIOB
#define GPIO_VBUS_DISCHARGE1_CLK_ENABLE()     __HAL_RCC_GPIOB_CLK_ENABLE()

#define GPIO_VBUS_DISCHARGE2_PIN              GPIO_PIN_14  /* PB.14 */
#define GPIO_VBUS_DISCHARGE2_PORT             GPIOB
#define GPIO_VBUS_DISCHARGE2_CLK_ENABLE()     __HAL_RCC_GPIOB_CLK_ENABLE()

#define GPIO_VCONN_EN1_PIN                    GPIO_PIN_4  /* PD.04 */
#define GPIO_VCONN_EN1_PORT                   GPIOD
#define GPIO_VCONN_EN1_CLK_ENABLE()           __HAL_RCC_GPIOD_CLK_ENABLE()

#define GPIO_VCONN_EN2_PIN                    GPIO_PIN_9  /* PB.09 */
#define GPIO_VCONN_EN2_PORT                   GPIOB
#define GPIO_VCONN_EN2_CLK_ENABLE()           __HAL_RCC_GPIOB_CLK_ENABLE()

#define GPIO_VCONN_DISCHARGE1_PIN             GPIO_PIN_2  /* PA.02 */
#define GPIO_VCONN_DISCHARGE1_PORT            GPIOA
#define GPIO_VCONN_DISCHARGE1_CLK_ENABLE()    __HAL_RCC_GPIOA_CLK_ENABLE()

#define GPIO_VCONN_DISCHARGE2_PIN             GPIO_PIN_0  /* PB.00 */
#define GPIO_VCONN_DISCHARGE2_PORT            GPIOB
#define GPIO_VCONN_DISCHARGE2_CLK_ENABLE()    __HAL_RCC_GPIOB_CLK_ENABLE()

#define GPIO_V_CTL2_PIN                       GPIO_PIN_1  /* PA.01 */
#define GPIO_V_CTL2_PORT                      GPIOA
#define GPIO_V_CTL2_CLK_ENABLE()              __HAL_RCC_GPIOA_CLK_ENABLE()

#define GPIO_V_CTL1_PIN                       GPIO_PIN_1  /* PC.01 */
#define GPIO_V_CTL1_PORT                      GPIOC
#define GPIO_V_CTL1_CLK_ENABLE()              __HAL_RCC_GPIOC_CLK_ENABLE()

/* Definition of ADCx clock resources */
#define ADCx                            ADC1
#define ADCx_CLK_ENABLE()               __HAL_RCC_ADC_CLK_ENABLE()
#define ADCx_CLK_DISABLE()              __HAL_RCC_ADC_CLK_DISABLE()

#define ADCx_FORCE_RESET()              __HAL_RCC_ADC_FORCE_RESET()
#define ADCx_RELEASE_RESET()            __HAL_RCC_ADC_RELEASE_RESET()

