STMicroelectronics/STM32CubeG0/Projects/STM32G081B-EVAL/Applications/USB-PD/USB-PD_Consumer_1port/Src/usbpd_pwr_user.c
/* Definition of ADCx channels */
#define ADCx_CHANNEL_VSENSE_1           ADC_CHANNEL_9
#define ADCx_CHANNEL_ISENSE_1           ADC_CHANNEL_11
#define ADCx_CHANNEL_VSENSE_2           ADC_CHANNEL_3
#define ADCx_CHANNEL_ISENSE_2           ADC_CHANNEL_16
#define ADCx_CHANNEL_VSENSE_DCDC        ADC_CHANNEL_15

/* Definition of ADCx channels */
#define ADCxChanneln 5

#define ADCx_CHANNEL_VSENSE_1_GPIO_CLK_ENABLE() __HAL_RCC_GPIOB_CLK_ENABLE()
#define ADCx_CHANNEL_VSENSE_1_GPIO_PORT         GPIOB
#define ADCx_CHANNEL_VSENSE_1_GPIO_PIN          GPIO_PIN_1

#define ADCx_CHANNEL_ISENSE_1_GPIO_CLK_ENABLE() __HAL_RCC_GPIOB_CLK_ENABLE()
#define ADCx_CHANNEL_ISENSE_1_GPIO_PORT         GPIOB
#define ADCx_CHANNEL_ISENSE_1_GPIO_PIN          GPIO_PIN_10

#define ADCx_CHANNEL_VSENSE_2_GPIO_CLK_ENABLE() __HAL_RCC_GPIOA_CLK_ENABLE()
#define ADCx_CHANNEL_VSENSE_2_GPIO_PORT         GPIOA
#define ADCx_CHANNEL_VSENSE_2_GPIO_PIN          GPIO_PIN_3

#define ADCx_CHANNEL_ISENSE_2_GPIO_CLK_ENABLE() __HAL_RCC_GPIOB_CLK_ENABLE()
#define ADCx_CHANNEL_ISENSE_2_GPIO_PORT         GPIOB
#define ADCx_CHANNEL_ISENSE_2_GPIO_PIN          GPIO_PIN_12

#define ADCx_CHANNEL_VSENSE_DCDC_GPIO_CLK_ENABLE() __HAL_RCC_GPIOB_CLK_ENABLE()
#define ADCx_CHANNEL_VSENSE_DCDC_GPIO_PORT         GPIOB
#define ADCx_CHANNEL_VSENSE_DCDC_GPIO_PIN          GPIO_PIN_11

/* Definition of ADCx DMA resources */
#define ADCx_DMA_CLK_ENABLE()           __HAL_RCC_DMA1_CLK_ENABLE()
#define ADCx_DMA                        DMA1_Channel1

/* Definition of DMA NVIC resources */
#define ADCx_DMA_IRQn                   DMA1_Channel1_IRQn
#define ADCx_DMA_IRQHandler             DMA1_Channel1_IRQHandler

/* Definition of ADCx NVIC resources */
#define ADCx_IRQn                       ADC1_COMP_IRQn
#define ADCx_IRQHandler                 ADC1_COMP_IRQHandler

/* VDD voltage (in mv)*/
#define VDD 3300

/* Maximum digital value of the ADC output (12 Bits resolution)
   To converting ADC measurement to an absolute voltage value:
   VCHANNELx = ADCx_DATA x (VDD/ADC_FULL_SCALE)
*/
#define ADC_FULL_SCALE 0x0FFF

/* VBUS connection detection voltage threshold (in mV) */
#define VBUS_CONNECTION_THRESHOLD 3000

/* VBUS disconnection detection voltage threshold (in mV) */
#define VBUS_DISCONNECTION_THRESHOLD 2200

/* Resistor voltage divider */
#define RA 330000
#define RB  49900

/* VBUS power source calibration parameters */
#define BSP_PWR_DCDC_POLL_TIME          1        /* DCDC polling periode in mS */
#define BSP_PWR_DCDC_MAX_PWM_VALUE      (3200u)   /* DCDC Vref: Max pwm min value 3.8V on RevB */
#define BSP_PWR_DCDC_MIN_PWM_VALUE      (1)      /* DCDC Vref: Max pwm max value 18V on RevB */
#define BSP_PWR_DCDC_MAX_PWM_STEP       (55)     /* DCDC Vref: Max pwm step = Full scale/25mS */
#define BSP_PWR_DCDC_MIN_PWM_STEP       (1)      /* DCDC Vref: Min pwm step */
#define BSP_PWR_DCDC_PLL_P_N            (9)      /* DCDC Coef P (0.xx)*/
#define BSP_PWR_DCDC_PLL_P_D            (9)      /* DCDC Coef P */
#define BSP_PWR_DCDC_PLL_D_N            (7)      /* DCDC Coef D (0.xx) */
#define BSP_PWR_DCDC_PLL_D_D            (8)      /* DCDC Coef D */

#define PWM_MAX_VALUES_LUT_PPS          131u

/* VBUS voltage level values (in mV) */
#define VBUS_VOLTAGE_0V_IN_MV   0u
#define VBUS_VOLTAGE_5V_IN_MV   5000u
#define VBUS_VOLTAGE_9V_IN_MV   9000u
#define VBUS_VOLTAGE_15V_IN_MV  15000u
#define VBUS_VOLTAGE_18V_IN_MV  18000u

/* VBUS sensing resume timeout value (in ms)*/
#define VBUS_SENSING_RESUME_TIMEOUT     (1U)

/* USER CODE END POWER_Private_Constants */
/**
  * @}
  */

/** @defgroup POWER_Private_Macros Private Macros
  * @{
  */
#if defined(_TRACE)
#define PWR_DEBUG_TRACE(_PORT_, __MESSAGE__)  USBPD_TRACE_Add(USBPD_TRACE_DEBUG,    (_PORT_), 0u, (uint8_t*)(__MESSAGE__), sizeof(__MESSAGE__) - 1u)
#else
#define PWR_DEBUG_TRACE(_PORT_, __MESSAGE__)
#endif /* _TRACE */
/* USER CODE BEGIN POWER_Private_Macros */
#define GPIOx_CLK_ENABLE(__GPIO__)   do { if((__GPIO__) == GPIO_SOURCE_EN)   GPIO_SOURCE_EN_CLK_ENABLE(); else \
                                          if((__GPIO__) == GPIO_VBUS_DISCHARGE1) GPIO_VBUS_DISCHARGE1_CLK_ENABLE(); else \
                                          if((__GPIO__) == GPIO_VBUS_DISCHARGE2) GPIO_VBUS_DISCHARGE2_CLK_ENABLE(); else \
                                          if((__GPIO__) == GPIO_VCONN_EN1)   GPIO_VCONN_EN1_CLK_ENABLE(); else \
                                          if((__GPIO__) == GPIO_VCONN_EN2)   GPIO_VCONN_EN2_CLK_ENABLE(); else \
                                          if((__GPIO__) == GPIO_VCONN_DISCHARGE1)     GPIO_VCONN_DISCHARGE1_CLK_ENABLE(); else \
                                          if((__GPIO__) == GPIO_VCONN_DISCHARGE2)     GPIO_VCONN_DISCHARGE2_CLK_ENABLE(); else \
                                          if((__GPIO__) == GPIO_V_CTL1)      GPIO_V_CTL1_CLK_ENABLE(); else \
                                          if((__GPIO__) == GPIO_V_CTL2)      GPIO_V_CTL2_CLK_ENABLE();} while(0)

#define ADCx_CHANNEL_GPIO_CLK_ENABLE(__ADC_CHANNEL__) \
  do { if ((__ADC_CHANNEL__) == ADCx_CHANNEL_VSENSE_1) ADCx_CHANNEL_VSENSE_1_GPIO_CLK_ENABLE(); else \
       if ((__ADC_CHANNEL__) == ADCx_CHANNEL_ISENSE_1) ADCx_CHANNEL_ISENSE_1_GPIO_CLK_ENABLE(); else \
       if ((__ADC_CHANNEL__) == ADCx_CHANNEL_VSENSE_2) ADCx_CHANNEL_VSENSE_2_GPIO_CLK_ENABLE(); else \
       if ((__ADC_CHANNEL__) == ADCx_CHANNEL_ISENSE_2) ADCx_CHANNEL_VSENSE_2_GPIO_CLK_ENABLE(); else \
       if ((__ADC_CHANNEL__) == ADCx_CHANNEL_VSENSE_DCDC) ADCx_CHANNEL_VSENSE_DCDC_GPIO_CLK_ENABLE();} while(0)

#define ABS(__VAL__) (((int32_t)(__VAL__)) < 0 ? - ((int32_t)(__VAL__)) : ((int32_t)(__VAL__)))

/* USER CODE END POWER_Private_Macros */
/**
  * @}
  */

/** @defgroup POWER_Private_Variables Private Variables
  * @{
  */
/* USER CODE BEGIN POWER_Private_Variables */
/**
* @brief GPIO variables
*/
/* GPIO Id. / GPIO port cross table */
static GPIO_TypeDef * GPIO_PORT[] = {
    GPIO_SOURCE_EN_PORT,
    GPIO_VBUS_DISCHARGE1_PORT,
    GPIO_VBUS_DISCHARGE2_PORT,
    GPIO_VCONN_EN1_PORT,
    GPIO_VCONN_EN2_PORT,
    GPIO_VCONN_DISCHARGE1_PORT,
    GPIO_VCONN_DISCHARGE2_PORT,
    GPIO_V_CTL1_PORT,
    GPIO_V_CTL2_PORT
};

/* GPIO Id. / GPIO pin cross table */
static const uint16_t GPIO_PIN[] = {
    GPIO_SOURCE_EN_PIN,
    GPIO_VBUS_DISCHARGE1_PIN,
    GPIO_VBUS_DISCHARGE2_PIN,
    GPIO_VCONN_EN1_PIN,
    GPIO_VCONN_EN2_PIN,
    GPIO_VCONN_DISCHARGE1_PIN,
    GPIO_VCONN_DISCHARGE2_PIN,
    GPIO_V_CTL1_PIN,
    GPIO_V_CTL2_PIN
};

