STMicroelectronics/STM32CubeG0/Projects/STM32G081B-EVAL/Applications/USB-PD/USB-PD_Consumer_1port/Src/usbpd_pwr_user.c
/* V/I Sense / ADC Channel cross table */
static const uint32_t ADC_CHANNEL[ADCxChanneln] =
{
    ADCx_CHANNEL_VSENSE_1,
    ADCx_CHANNEL_ISENSE_1,
    ADCx_CHANNEL_VSENSE_2,
    ADCx_CHANNEL_ISENSE_2,
    ADCx_CHANNEL_VSENSE_DCDC
};

/* ADC Channel / GPIO port cross table */
static GPIO_TypeDef *  ADC_CHANNEL_PORT[ADCxChanneln] =
{
    ADCx_CHANNEL_VSENSE_1_GPIO_PORT,
    ADCx_CHANNEL_ISENSE_1_GPIO_PORT,
    ADCx_CHANNEL_VSENSE_2_GPIO_PORT,
    ADCx_CHANNEL_ISENSE_2_GPIO_PORT,
    ADCx_CHANNEL_VSENSE_DCDC_GPIO_PORT
};

/* ADC Channel / GPIO pin cross table */
const uint32_t ADC_CHANNEL_PIN[ADCxChanneln] =
{
    ADCx_CHANNEL_VSENSE_1_GPIO_PIN,
    ADCx_CHANNEL_ISENSE_1_GPIO_PIN,
    ADCx_CHANNEL_VSENSE_2_GPIO_PIN,
    ADCx_CHANNEL_ISENSE_2_GPIO_PIN,
    ADCx_CHANNEL_VSENSE_DCDC_GPIO_PIN
};

/* Variable containing ADC conversions results
   aADCxConvertedValues[0]: VSENSE_2
   aADCxConvertedValues[1]: VSENSE_1
   aADCxConvertedValues[2]: ISENSE_1
   aADCxConvertedValues[3]: ISENSE_2
*/
static __IO uint16_t   aADCxConvertedValues[4] = {0};

/* BSP PWR contextual data */
static ContextTypeDef Context =
{
    .ADCRefCount         = 0,
    .DCDCCtrlMode        = DCDC_CTRL_MODE_UNKNOWN,
    .PortInfo =
    {
        /* TYPE_C_PORT_1 */
        {
            .State                      = PORT_NOT_INITIALIZED,
            .Role                       = POWER_ROLE_SOURCE,
            .VBUSDisconnectionThreshold = VBUS_DISCONNECTION_THRESHOLD,
            .VBUSConnectionStatus       = VBUS_NOT_CONNECTED,
            .pfnVBUSDetectCallback      = (PWR_VBUSDetectCallbackFunc *)NULL,
            .VBUSVoltage                = 0,
        },
        /* TYPE_C_PORT_2 */
        {
            .State                      = PORT_NOT_INITIALIZED,
            .Role                       = POWER_ROLE_SINK,
            .VBUSDisconnectionThreshold = VBUS_DISCONNECTION_THRESHOLD,
            .VBUSConnectionStatus       = VBUS_NOT_CONNECTED,
            .pfnVBUSDetectCallback      = (PWR_VBUSDetectCallbackFunc *)NULL,
            .VBUSVoltage                = 0,
        }
    }
};

/* VBUS sensing completed flag */
uint8_t VBUSSensingCompleted = 0;

/* Power source calibration related variables */
uint16_t aPWMDutyCycleLUT[VBUS_LEVEL_NB] = {
  0x00B0,   /* 5V */
  0x0200,   /* 9V */
  0x0300,   /* 15V */
  0x0400,   /* 18V */
  0x0000    /* Will be used to store latest PPS request */
};

uint8_t aPWMDutyCalibrated[VBUS_LEVEL_NB] = {
  0x0,   /* 5V */
  0x0,   /* 9V */
  0x0,   /* 15V */
  0x0,   /* 18V */
  0x0    /* Will be used to store latest PPS request */
};

uint16_t aPWMDutyCycleLUT_PPS[PWM_MAX_VALUES_LUT_PPS] =
{
/* 3300, 3320, 3340, 3360, 3380, 3400, 3420, 3440, 3460, 3480 */
   48,   52,   56,   61,   65,   70,   74,   79,   83,   88,
/* 3500, 3520, 3540, 3560, 3580, 3600, 3620, 3640, 3660, 3680 */
   92,   97,   101,   106,   110,   115,   119,   124,   128,   133,
/* 3700, 3720, 3740, 3760, 3780, 3800, 3820, 3840, 3860, 3880 */
   137,   142,   146,   151,   155,   160,   164,   169,   173,   177,
/* 3900, 3920, 3940, 3960, 3980, 4000, 4020, 4040, 4060, 4080 */
   182,   186,   191,   195,   200,   204,   209,   213,   218,   222,
/* 4100, 4120, 4140, 4160, 4180, 4200, 4220, 4240, 4260, 4280 */
   227,   231,   236,   240,   245,   249,   254,   258,   263,   267,
/* 4300, 4320, 4340, 4360, 4380, 4400, 4420, 4440, 4460, 4480 */
   272,   276,   281,   285,   290,   294,   299,   303,   307,   312,
/* 4500, 4520, 4540, 4560, 4580, 4600, 4620, 4640, 4660, 4680 */
   316,   321,   325,   330,   334,   339,   343,   348,   352,   357,
/* 4700, 4720, 4740, 4760, 4780, 4800, 4820, 4840, 4860, 4880 */
   361,   366,   370,   375,   379,   384,   388,   393,   397,   402,
/* 4900, 4920, 4940, 4960, 4980, 5000, 5020, 5040, 5060, 5080 */
   406,   411,   415,   420,   424,   429,   433,   437,   442,   446,
/* 5100, 5120, 5140, 5160, 5180, 5200, 5220, 5240, 5260, 5280 */
   451,   455,   460,   464,   469,   473,   478,   482,   487,   491,
/* 5300, 5320, 5340, 5360, 5380, 5400, 5420, 5440, 5460, 5480 */
   496,   500,   505,   509,   514,   518,   523,   527,   532,   536,
/* 5500, 5520, 5540, 5560, 5580, 5600, 5620, 5640, 5660, 5680 */
   541,   545,   550,   554,   558,   563,   567,   572,   576,   581,
/* 5700, 5720, 5740, 5760, 5780, 5800, 5820, 5840, 5860, 5880 */
   585,   590,   594,   599,   603,   608,   612,   617,   621,   626,
/* 5900 */
   630
};

uint8_t aPWMDutyCalibrated_PPS[PWM_MAX_VALUES_LUT_PPS] = { 0 };

/* USER CODE END POWER_Private_Variables */
/**
  * @}
  */

/** @defgroup POWER_Private_Functions Private Functions
  * @{
  */
/* USER CODE BEGIN POWER_Private_Prototypes */
static uint8_t  PWR_InitSource(uint32_t PortId);
static uint8_t  PWR_DeInitSource(uint32_t PortId);
static uint8_t  PWR_InitSink(uint32_t PortId);
static uint8_t  PWR_DeInitSink(uint32_t PortId);
static void     PWR_GPIO_Init(GPIO_Id_TypeDef gpio);
static void     PWR_GPIO_DeInit(GPIO_Id_TypeDef gpio);
static void     PWR_GPIO_On(GPIO_Id_TypeDef gpio);
static void     PWR_GPIO_Off(GPIO_Id_TypeDef gpio);
static uint8_t  PWR_ADC_SetConfig(void);
static void     PWR_ADC_ResetConfig(void);
static uint8_t  PWR_ADC_SetChannelConfig(ADC_ChannelId_TypeDef ADCChannel);
static void     PWR_ADC_ResetChannelConfig(ADC_ChannelId_TypeDef ADCChannel);
static uint32_t PWR_ConvertADCDataToVoltage(uint32_t ADCData);
static uint32_t PWR_ConvertVoltageToThreshold(uint32_t PWR_ConvertVoltageToThreshold);
static int32_t  PWR_ConvertADCDataToCurrent(uint32_t ADCData);
static uint8_t  PWR_StartVBusSensing(void);
static uint8_t  PWR_StopVBusSensing(void);
static uint8_t  PWR_PauseVBusSensing(void);
static uint8_t  PWR_ResumeVBusSensing(void);
static uint8_t  PWR_InitPowerSource(void);
static void     PWR_DeInitPowerSource(void);
static void     PWR_SetPWMDutyCycle(uint16_t PWMDutyCycle);
static uint16_t PWR_GetPWMDutyCycle(void);
static uint32_t PWR_DCDCPreChargeC57(uint32_t PortId);
static PWR_StatusTypeDef PWR_VBUSSetVoltage(uint32_t PortId,
                                         uint32_t VBusInmV,
                                         uint16_t Precision);
uint32_t PWR_DCDCGetVoltage(uint32_t PortId);
static void ADCx_MspInit(ADC_HandleTypeDef *hadc);
static void ADCx_MspDeInit(ADC_HandleTypeDef *hadc);
static void LPTIMx_MspInit(LPTIM_HandleTypeDef *hlptim);
static void LPTIMx_MspDeInit(LPTIM_HandleTypeDef *hlptim);
static void     PWR_VBUSDischarge(uint32_t PortId,
                           uint32_t VbusStopInmV,
                           uint32_t VbusErrorInmV,
                           uint16_t Delay);
/* USER CODE END POWER_Private_Prototypes */
/**
  * @}
  */

