STMicroelectronics/STM32CubeG0/Projects/STM32G081B-EVAL/Applications/USB-PD/USB-PD_Consumer_1port/Src/usbpd_pwr_user.c
/** @defgroup POWER_Exported_Variables Exported Variables
  * @{
  */
/* USER CODE BEGIN POWER_Exported_Variables */
extern ADC_HandleTypeDef hadc1;
extern DMA_HandleTypeDef hdma_adc1;
LPTIM_HandleTypeDef hlptim  = {0};
/* USER CODE END POWER_Exported_Variables */
/**
  * @}
  */

/** @addtogroup POWER_Exported_Functions
  * @{
  */
/**
  * @brief  Initialize the hardware resources used by the Type-C power delivery (PD)
  *         controller.
  * @note   Obsolete interface, new interface should be called.
  * @param  PortId Type-C port identifier
  *         This parameter can be take one of the following values:
  *         @arg TYPE_C_PORT_1
  *         @arg TYPE_C_PORT_2
  * @retval PD controller status
  */
__weak PWR_StatusTypeDef BSP_PWR_VBUSInit(uint32_t               PortId)
{
  PWR_DEBUG_TRACE(PortId, "ADVICE: Obsolete BSP_PWR_VBUSInit");
/* USER CODE BEGIN BSP_PWR_VBUSInit */
  uint32_t ret = 0;
  PWR_PowerRoleTypeDef   role;

  if (Context.PortInfo[PortId].State == PORT_NOT_INITIALIZED)
  {
    if (PortId == TYPE_C_PORT_1)
    {
      role = POWER_ROLE_DUAL;
      PWR_GPIO_Init(GPIO_VCONN_EN1);
      PWR_GPIO_Init(GPIO_VCONN_EN2);
}
    else
{
      role = POWER_ROLE_SINK;
    }

    /* SINK / SOURCE initialization order is important: in case of dual role
    SINK must be initialized before SOURCE. */
    if ((role == POWER_ROLE_SINK) || (role == POWER_ROLE_DUAL))
    {
      ret += PWR_InitSink(PortId);

      if (Context.ADCRefCount == 1)
      {
        ret += PWR_StartVBusSensing();
      }
    }

    if ((role == POWER_ROLE_SOURCE) || (role == POWER_ROLE_DUAL))
    {
      ret += PWR_InitSource(PortId);
    }

    /* Update PWR context */
    Context.PortInfo[PortId].State = PORT_INITIALIZED;
    Context.PortInfo[PortId].Role = role;
  }

  return (ret == 0) ? PWR_OK : PWR_ERROR;
/* USER CODE END BSP_PWR_VBUSInit */
}

/**
  * @brief  Release the hardware resources used by the Type-C power delivery (PD)
  *         controller.
  * @note   Obsolete interface, new interface should be called.
  * @param  PortId Type-C port identifier
  *         This parameter can be take one of the following values:
  *         @arg TYPE_C_PORT_1
  *         @arg TYPE_C_PORT_2
  * @retval PD controller status
  */
__weak PWR_StatusTypeDef BSP_PWR_VBUSDeInit(uint32_t PortId)
{
  PWR_DEBUG_TRACE(PortId, "ADVICE: Obsolete BSP_PWR_VBUSDeInit");
/* USER CODE BEGIN BSP_PWR_VBUSDeInit */
  uint32_t ret = 0;

  if (Context.PortInfo[PortId].State == PORT_INITIALIZED)
  {
    if (PortId == TYPE_C_PORT_1)
    {
      PWR_GPIO_DeInit(GPIO_VCONN_EN1);
      PWR_GPIO_DeInit(GPIO_VCONN_EN2);
    }

    if ((Context.PortInfo[PortId].Role == POWER_ROLE_SOURCE) ||
        (Context.PortInfo[PortId].Role == POWER_ROLE_DUAL))
    {
      ret += PWR_DeInitSource(PortId);
    }

    if ((Context.PortInfo[PortId].Role == POWER_ROLE_SINK) ||
        (Context.PortInfo[PortId].Role == POWER_ROLE_DUAL))
    {
      if (Context.ADCRefCount == 1)
      {
        ret += PWR_StopVBusSensing();
      }
      ret += PWR_DeInitSink(PortId);
    }

    /* Update PWR context */
    Context.PortInfo[PortId].State = PORT_NOT_INITIALIZED;
  }

  return (ret == 0) ? PWR_OK : PWR_ERROR;
/* USER CODE END BSP_PWR_VBUSDeInit */
}

/**
  * @brief  Enable power supply over VBUS.
  * @note   Obsolete interface, new interface should be called.
  * @param  PortId Type-C port identifier
  *         This parameter can be take one of the following values:
  *         @arg TYPE_C_PORT_1
  *         @arg TYPE_C_PORT_2
  * @retval PD controller status
  */
__weak PWR_StatusTypeDef BSP_PWR_VBUSOn(uint32_t PortId)
{
  PWR_DEBUG_TRACE(PortId, "ADVICE: Obsolete BSP_PWR_VBUSOn");
/* USER CODE BEGIN BSP_PWR_VBUSOn */
  PWR_StatusTypeDef retr = PWR_OK;

  if (PortId == TYPE_C_PORT_1)
  {
    /* Start VBUS Discharge */
    PWR_GPIO_On(GPIO_VBUS_DISCHARGE1);

    /* safety control to avoid spike when enabling the power */
    /* issue detected during board reset */
    uint32_t _tickstart = HAL_GetTick();
    uint32_t _dcdc;
    uint32_t _delta = PWR_DCDCGetVoltage(PortId);

    do {
      _dcdc = PWR_DCDCGetVoltage(PortId);

      /* check after 2 second check if the power has start to decrease */
      if((((HAL_GetTick() - _tickstart) > 2000)) && ((_delta - _dcdc) < 500))
      {
  return PWR_ERROR;
      }

      /* Timeout management */
      if((HAL_GetTick() - _tickstart) > 15000)
      {
        return PWR_ERROR;
      }
    }
    while (_dcdc > 5500);

    /* Switch on VBUS */
    PWR_GPIO_On(GPIO_SOURCE_EN);

    /* Set VBUS to its default voltage level */
    retr = PWR_VBUSSetVoltage(PortId, VBUS_VOLTAGE_5V_IN_MV, 200); /* 5% max = 250mV max */

    /* Stop VBUS Discharge */
    PWR_GPIO_Off(GPIO_VBUS_DISCHARGE1);
  }
  else
  {
    retr = PWR_ERROR;
  }

  /* Save the power context */
  Context.PortInfo[PortId].VBUSVoltage = VBUS_VOLTAGE_5V_IN_MV;
  Context.PortInfo[PortId].Type = POWER_FIXED;

  return retr;
/* USER CODE END BSP_PWR_VBUSOn */
}

/**
  * @brief  Disable power supply over VBUS.
  * @note   Obsolete interface, new interface should be called.
  * @param  PortId Type-C port identifier
  *         This parameter can be take one of the following values:
  *         @arg TYPE_C_PORT_1
  *         @arg TYPE_C_PORT_2
  * @retval PD controller status
  */
__weak PWR_StatusTypeDef BSP_PWR_VBUSOff(uint32_t PortId)
{
  PWR_DEBUG_TRACE(PortId, "ADVICE: Obsolete BSP_PWR_VBUSOff");
/* USER CODE BEGIN BSP_PWR_VBUSOff */
  uint32_t ret = 0;

  if (PortId == TYPE_C_PORT_1)
  {
    /* Go back to original VBUS value */
    PWR_VBUSSetVoltage(0, VBUS_VOLTAGE_0V_IN_MV, 0);

    /* Discharge VBUS */
    PWR_VBUSDischarge(PortId, BSP_PWR_LOW_VBUS_THRESHOLD, 0, 0);

  }
  else
  {
    ret++;
  }

   /* Save the power context */
  Context.PortInfo[PortId].VBUSVoltage = VBUS_VOLTAGE_0V_IN_MV;
  Context.PortInfo[PortId].Type = POWER_NONE;

  return (ret == 0) ? PWR_OK : PWR_ERROR;
/* USER CODE END BSP_PWR_VBUSOff */
}

/**
  * @brief  Set a fixed/variable PDO and manage the power control.
  * @note   Obsolete interface, new interface should be called.
  * @param  PortId Type-C port identifier
  *         This parameter can be take one of the following values:
  *         @arg TYPE_C_PORT_1
  *         @arg TYPE_C_PORT_2
  * @param  VbusTargetInmv the vbus Target (in mV)
  * @param  OperatingCurrent the Operating Current (in mA)
  * @param  MaxOperatingCurrent the Max Operating Current (in mA)
  * @retval PD controller status
  */
__weak PWR_StatusTypeDef BSP_PWR_VBUSSetVoltage_Fixed(uint32_t PortId,
                                               uint32_t VbusTargetInmv,
                                               uint32_t OperatingCurrent,
                                               uint32_t MaxOperatingCurrent)
{
  PWR_DEBUG_TRACE(PortId, "ADVICE: Obsolete BSP_PWR_VBUSSetVoltage_Fixed");
/* USER CODE BEGIN BSP_PWR_VBUSSetVoltage_Fixed */
  PWR_StatusTypeDef retr = PWR_OK;

  if(Context.PortInfo[PortId].VBUSVoltage != VbusTargetInmv)
  {
    /* Start VBUS Discharge, done to increase the decrease speed */
    PWR_GPIO_On(GPIO_VBUS_DISCHARGE1);

