STMicroelectronics/STM32CubeG0/Projects/STM32G081B-EVAL/Applications/USB-PD/USB-PD_Consumer_1port/Src/usbpd_pwr_user.c
  if (PortId == TYPE_C_PORT_1)
  {
    switch(CCPinId)
    {
    case TYPE_C_CC1 :
      {
        PWR_GPIO_Init(GPIO_VCONN_DISCHARGE1);
        ret = PWR_OK;
      }
      break;
    case TYPE_C_CC2 :
      {
        PWR_GPIO_Init(GPIO_VCONN_DISCHARGE2);
        ret = PWR_OK;
      }
      break;
    default:
      break;
    }
  }
  return ret;
/* USER CODE END BSP_PWR_VCONNInit */
}

/**
  * @brief  Un-Initialize VCONN sourcing.
  * @note   Obsolete interface, new interface should be called.
  * @param  PortId Type-C port identifier
  *         This parameter can be take one of the following values:
  *         @arg TYPE_C_PORT_1
  *         @arg TYPE_C_PORT_2
  * @param  CCPinId Type-C CC pin identifier
  *         This parameter can be take one of the following values:
  *         @arg TYPE_C_CC1
  *         @arg TYPE_C_CC2
  * @retval PD controller status
  */
__weak PWR_StatusTypeDef BSP_PWR_VCONNDeInit(uint32_t PortId,
                                      uint32_t CCPinId)
{
  PWR_DEBUG_TRACE(PortId, "ADVICE: Obsolete BSP_PWR_VCONNDeInit");
/* USER CODE BEGIN BSP_PWR_VCONNDeInit */
  PWR_StatusTypeDef ret = PWR_ERROR;

  if (PortId == TYPE_C_PORT_1)
  {
    switch(CCPinId)
    {
    case TYPE_C_CC1 :
      {
        PWR_GPIO_DeInit(GPIO_VCONN_DISCHARGE1);
        ret = PWR_OK;
      }
      break;
    case TYPE_C_CC2 :
      {
        PWR_GPIO_DeInit(GPIO_VCONN_DISCHARGE2);
        ret = PWR_OK;
      }
      break;
    default:
      break;
    }
  }
  return ret;
/* USER CODE END BSP_PWR_VCONNDeInit */
}

/**
  * @brief  Enable VCONN sourcing.
  * @note   Obsolete interface, new interface should be called.
  * @param  PortId Type-C port identifier
  *         This parameter can be take one of the following values:
  *         @arg TYPE_C_PORT_1
  *         @arg TYPE_C_PORT_2
  * @param  CCPinId Type-C CC pin identifier
  *         This parameter can be take one of the following values:
  *         @arg TYPE_C_CC1
  *         @arg TYPE_C_CC2
  * @retval PD controller status
  */
__weak PWR_StatusTypeDef BSP_PWR_VCONNOn(uint32_t PortId,
                                  uint32_t CCPinId)
{
  PWR_DEBUG_TRACE(PortId, "ADVICE: Obsolete BSP_PWR_VCONNOn");
/* USER CODE BEGIN BSP_PWR_VCONNOn */
  PWR_StatusTypeDef ret = PWR_ERROR;

  if (PortId == TYPE_C_PORT_1)
  {
    if (CCPinId == TYPE_C_CC1)
    {
      PWR_GPIO_On(GPIO_VCONN_EN1);
      ret = PWR_OK;
    }
    else if (CCPinId == TYPE_C_CC2)
    {
      PWR_GPIO_On(GPIO_VCONN_EN2);
      ret = PWR_OK;
    }
  }

  return ret;
/* USER CODE END BSP_PWR_VCONNOn */
}

/**
  * @brief  Disable VCONN sourcing.
  * @note   Obsolete interface, new interface should be called.
  * @param  PortId Type-C port identifier
  *         This parameter can be take one of the following values:
  *         @arg TYPE_C_PORT_1
  *         @arg TYPE_C_PORT_2
  * @param  CCPinId CC pin identifier
  *         This parameter can be take one of the following values:
  *         @arg TYPE_C_CC1
  *         @arg TYPE_C_CC2
  * @retval PD controller status
  */
__weak PWR_StatusTypeDef BSP_PWR_VCONNOff(uint32_t PortId,
                                   uint32_t CCPinId)
{
  PWR_DEBUG_TRACE(PortId, "ADVICE: Obsolete BSP_PWR_VCONNOff");
/* USER CODE BEGIN BSP_PWR_VCONNOff */
  PWR_StatusTypeDef ret = PWR_ERROR;

  if (PortId == TYPE_C_PORT_1)
  {
    if (CCPinId == TYPE_C_CC1)
    {
      /* switch off Vconn */
      PWR_GPIO_Off(GPIO_VCONN_EN1);
      PWR_GPIO_On(GPIO_VCONN_EN1);
      PWR_GPIO_Off(GPIO_VCONN_EN1);

      /* Dicharge VCONN */
      PWR_GPIO_On(GPIO_VCONN_DISCHARGE1);
      HAL_Delay(1);
      PWR_GPIO_Off(GPIO_VCONN_DISCHARGE1);
      ret = PWR_OK;
    }
    else if (CCPinId == TYPE_C_CC2)
    {
      /* switch off Vconn */
      PWR_GPIO_Off(GPIO_VCONN_EN2);
      PWR_GPIO_On(GPIO_VCONN_EN2);
      PWR_GPIO_Off(GPIO_VCONN_EN2);

      /* Dicharge VCONN */
      PWR_GPIO_On(GPIO_VCONN_DISCHARGE2);
      HAL_Delay(1);
      PWR_GPIO_Off(GPIO_VCONN_DISCHARGE2);
      ret = PWR_OK;
    }
  }

  return ret;
/* USER CODE END BSP_PWR_VCONNOff */
}

/**
  * @brief  Set the VBUS disconnection voltage threshold.
  * @note   Obsolete interface, new interface should be called.
  * @note   Callback function registered through BSP_PWR_RegisterVBUSDetectCallback
  *         function call is invoked when VBUS falls below programmed threshold.
  * @note   By default VBUS disconnection threshold is set to 3.3V
  * @param  PortId Type-C port identifier
  *         This parameter can be take one of the following values:
  *         @arg TYPE_C_PORT_1
  *         @arg TYPE_C_PORT_2
  * @param  VoltageThreshold: VBUS disconnection voltage threshold (in mV)
  * @retval PD controller status
  */
__weak void BSP_PWR_SetVBUSDisconnectionThreshold(uint32_t PortId,
                                           uint32_t VoltageThreshold)
{
  PWR_DEBUG_TRACE(PortId, "ADVICE: Obsolete BSP_PWR_SetVBUSDisconnectionThreshold");
/* USER CODE BEGIN BSP_PWR_SetVBUSDisconnectionThreshold */
  /* Update PWR context */
  if (VoltageThreshold <= VBUS_CONNECTION_THRESHOLD)
  {
    Context.PortInfo[PortId].VBUSDisconnectionThreshold = VoltageThreshold;
  }
/* USER CODE END BSP_PWR_SetVBUSDisconnectionThreshold */
}

/**
  * @brief  Register USB Type-C Current callback function.
  * @note   Obsolete interface, new interface should be called.
  * @note   Callback function invoked when VBUS rises above 4V (VBUS present) or
  *         when VBUS falls below programmed threshold (VBUS absent).
  * @note   Callback function is un-registered when callback function pointer
  *         argument is NULL.
  * @param  PortId Type-C port identifier
  *         This parameter can be take one of the following values:
  *         @arg TYPE_C_PORT_1
  *         @arg TYPE_C_PORT_2
  * @param  pfnVBUSDetectCallback callback function pointer
  * @retval 0 success else fail
  */
__weak PWR_StatusTypeDef BSP_PWR_RegisterVBUSDetectCallback(uint32_t                       PortId,
                                                     PWR_VBUSDetectCallbackFunc *   pfnVBUSDetectCallback)
{
  PWR_DEBUG_TRACE(PortId, "ADVICE: Obsolete BSP_PWR_RegisterVBUSDetectCallback");
/* USER CODE BEGIN BSP_PWR_RegisterVBUSDetectCallback */
  return PWR_ERROR;
/* USER CODE END BSP_PWR_RegisterVBUSDetectCallback */
}

/**
  * @brief  Get actual VBUS status.
  * @note   Obsolete interface, new interface should be called.
  * @param  PortId Type-C port identifier
  *         This parameter can be take one of the following values:
  *         @arg TYPE_C_PORT_1
  *         @arg TYPE_C_PORT_2
  * @retval VBUS status (1: On, 0: Off)
  */
__weak uint8_t BSP_PWR_VBUSIsOn(uint32_t PortId)
{
  PWR_DEBUG_TRACE(PortId, "ADVICE: Obsolete BSP_PWR_VBUSIsOn");
/* USER CODE BEGIN BSP_PWR_VBUSIsOn */
  if (PortId == TYPE_C_PORT_1)
  {
    return (READ_BIT(GPIO_PORT[GPIO_SOURCE_EN]->ODR, GPIO_PIN[GPIO_SOURCE_EN]) == GPIO_PIN[GPIO_SOURCE_EN]) ? 1 : 0;
  }
  else
  {
    return 0;
  }
/* USER CODE END BSP_PWR_VBUSIsOn */
}

/**
  * @brief  Get actual VCONN status.
  * @note   Obsolete interface, new interface should be called.
  * @param  PortId Type-C port identifier
  *         This parameter can be take one of the following values:
  *         @arg TYPE_C_PORT_1
  *         @arg TYPE_C_PORT_2
  * @param  CCPinId Type-C CC pin identifier
  *         This parameter can be take one of the following values:
  *         @arg TYPE_C_CC1
  *         @arg TYPE_C_CC2
  * @retval VCONN status (1: On, 0: Off)
  */
__weak uint8_t BSP_PWR_VCONNIsOn(uint32_t PortId,
                          uint32_t CCPinId)
{
  PWR_DEBUG_TRACE(PortId, "ADVICE: Obsolete BSP_PWR_VCONNIsOn");
/* USER CODE BEGIN BSP_PWR_VCONNIsOn */
  GPIO_Id_TypeDef gpio;

