STMicroelectronics/STM32CubeG0/Projects/STM32G081B-EVAL/Applications/USB-PD/USB-PD_Consumer_1port/Src/usbpd_pwr_user.c
end_of_DCDC_voltage_measure:
  return voltage;
}

/**
 * @brief  Set VBUS voltage level
 * @param  PortId Type-C port identifier
 *         This parameter can be take one of the following values:
 *         @arg TYPE_C_PORT_1
 *         @arg TYPE_C_PORT_2
 * @param  VBusInmV  VBUS voltage level setpoint(in mV)
 * @param  Calibration Calibration control
 *         This parameter can be take one of the following values:
 *         0: :calibration disabled
 *         1: :calibration enabled
 * @param  Precision Requested precision (in mV)
 * @note  Calibration and Precision paremeters aren't relevant when the VBUS
 *        voltage level isn't controlled by a PWM signal.
 * @note  When VBUS voltage level is controlled by a PWM signal, VBUS voltage is
 *        controlled by a PD (Proportional-Derivative) control loop.
 *        The PD control implementation is ilustrated by the block diagram below:
 *
 *                                              .-------------------.
 *                 .-------.              .------> PROPORTIONAL (Kp) >-.   .-------.
 *                 |  ADD  | pwm_error    |      '-------------------'  |  |  ADD  |  pwm  .---------------.
 *    VBusInmV --> +       >--------------|                             '--> +     >-------> PWM generator >-.
 *                 |       |              |     .------------------.       |       |       '---------------' |
 * vbus_measured .-> -     |              '----->  DERIVATIVE (Kd) >-------> +     |                         |
 *               | '-------'  pwm_error_previous ->                  |       '-------'                         |
 *               |                              '------------------'                                         |
 *               '-------------------------------------------------------------------------------------------'
 *
 *   pwm = Kp * pwm_error + (Kd * der)
 *
 * where:
 *  pwm_error is calulated from vbus_error
 *  Kp = Proptional Constant.
 *  Kd = Derivative Constant.
 *  der  = pwm_error - pwm_error_previous
*  (der: differential error)
*/
static PWR_StatusTypeDef PWR_VBUSSetVoltage(uint32_t PortId,
                                         uint32_t VBusInmV,
                                                uint16_t Precision)
{
  PWR_StatusTypeDef _retr = PWR_OK;
  static uint16_t          duty_cycle;
  uint8_t           duty_calibrated = 0;
  uint32_t          vbus_measured;

  if (PortId == TYPE_C_PORT_1)
  {
    duty_cycle =  PWR_GetPWMDutyCycle();
    switch (VBusInmV)
    {
    case VBUS_VOLTAGE_0V_IN_MV:
      {
      duty_cycle    = 0x10;
      /* Set PWM duty cycle to its initial value */
      PWR_SetPWMDutyCycle(duty_cycle);
      return PWR_OK;
      }

    case VBUS_VOLTAGE_5V_IN_MV:
      duty_cycle      = aPWMDutyCycleLUT[VBUS_5_V];
      duty_calibrated = aPWMDutyCalibrated[VBUS_5_V];
      break;
    case VBUS_VOLTAGE_9V_IN_MV:
      duty_calibrated = aPWMDutyCalibrated[VBUS_9_V];
      if (1 == duty_calibrated )
      {
        duty_cycle = aPWMDutyCycleLUT[VBUS_9_V];
      }
      break;
    case VBUS_VOLTAGE_15V_IN_MV:
      duty_calibrated = aPWMDutyCalibrated[VBUS_15_V];
      if (1 == duty_calibrated )
      {
        duty_cycle = aPWMDutyCycleLUT[VBUS_15_V];
      }
      break;
    case VBUS_VOLTAGE_18V_IN_MV:
      duty_cycle      = aPWMDutyCycleLUT[VBUS_18_V];
      if (1 == duty_calibrated )
      {
        duty_cycle = aPWMDutyCycleLUT[VBUS_18_V];
      }
      break;
    default:
      duty_cycle    = aPWMDutyCycleLUT[VBUS_5_V];
#if _PPS==USBPD_TRUE
      if (VBusInmV <= 5900)
      {
        duty_cycle      = aPWMDutyCycleLUT_PPS[(VBusInmV - 3300) / 20];
        duty_calibrated = aPWMDutyCalibrated_PPS[(VBusInmV - 3300) / 20];
      }
#endif /* _PPS */
      break;
    }


    if (duty_calibrated == 1)
    {
      uint32_t _tickstart = HAL_GetTick();
      PWR_SetPWMDutyCycle(duty_cycle);

      /* Check if the voltage is at the expected level */
      do
      {
          (void)BSP_USBPD_PWR_VBUSGetVoltage(PortId, &vbus_measured);
          for(int32_t index=0; index < 2000; index++){ __DSB();};
          /* timeout to avoid infinite loop in case of power default */
          if((HAL_GetTick() - _tickstart) > 300)
          {
            /* discard the VBUS and return an error */
            (void)BSP_USBPD_PWR_VBUSOff(PortId);
            return PWR_ERROR;
          }

     } while(ABS(vbus_measured -  VBusInmV)> 200);
    }
    else
    {
      int32_t           vbus_error;
      int32_t           vbus_previous;
      int32_t           pwm;
      int32_t           pwm_step_current;
      int32_t           pwm_step_previous=0;
      int32_t           pwm_error = 0;
      int32_t           pwm_error_previous;
      uint8_t            nb_pll_loop;
      pwm_step_previous = 0;
      pwm_step_current = duty_cycle;
      vbus_previous = vbus_measured = 0;
      nb_pll_loop = 0;

      do
      {
        pwm_step_previous = pwm_step_current;
        vbus_previous = vbus_measured;
        pwm_error_previous = pwm_error;
        pwm_error = 0;
        pwm = 0;

        PWR_SetPWMDutyCycle(duty_cycle);

        /* We can not avoid this DCDC takes time to lock .... */
        for(int32_t index=0; index < 7000; index++){ __DSB();};

        /* Measure actual VBUS voltage level */
        (void)BSP_USBPD_PWR_VBUSGetVoltage(PortId, &vbus_measured);
        /* Protection to handle the case where power is not present */
        if(vbus_measured < 300)
        {
          /* discard the VBUS and return an error */
          (void)BSP_USBPD_PWR_VBUSOff(PortId);
          return PWR_ERROR;
        }

       /* Calculate VBUS error = target - the measure */
        vbus_error = (int32_t)(VBusInmV) - (int32_t)(vbus_measured);

        /* Convert VBUS error into PWM error (pwm_error) */
        if ((ABS(vbus_error) >= BSP_PWR_DCDC_PRECISION))
        {
          /* Calculate PWM error */
          pwm_error = (1000 * duty_cycle) / vbus_measured;
          pwm_error *= vbus_error;
          pwm_error /= 1000;

          /* Calculate new PWM setpoint */
          pwm = pwm_error*(int32_t)BSP_PWR_DCDC_PLL_P_N;
          pwm /= (int32_t)BSP_PWR_DCDC_PLL_P_D;
          pwm += (((pwm_error)-(pwm_error_previous))*(int32_t)BSP_PWR_DCDC_PLL_D_N)/((int32_t)BSP_PWR_DCDC_PLL_D_D);
        }

        /* Set PWM setpoint to its min value (if min DCDC capabilities is reached) */
        if (pwm == 0)
        {
          if (vbus_error > 0)
          {
            pwm = (int32_t)BSP_PWR_DCDC_MIN_PWM_STEP;
          }
          else
          {
            pwm = -(int32_t)BSP_PWR_DCDC_MIN_PWM_STEP;
          }
        }
        /* Limit PWM setpoint to max value (if required) */
        else if (ABS(pwm) >= (uint32_t)BSP_PWR_DCDC_MAX_PWM_STEP)
        {
          if (pwm > 0)
          {
            pwm = (int32_t)BSP_PWR_DCDC_MAX_PWM_STEP;
          }
          else
          {
            pwm = -(int32_t)BSP_PWR_DCDC_MAX_PWM_STEP;
          }
        }

        /* Calculate duty cycle setpoint from PWM setpoint */
        if (pwm > 0)
        {
          if ((duty_cycle + (uint32_t)(pwm)) <= (uint32_t)BSP_PWR_DCDC_MAX_PWM_VALUE)
          {
            duty_cycle += (uint32_t)ABS(pwm);
          }
          else
          {
            /* Error case: Go back to 5V or 0V and break? */
          }
        }
        else
        {
          if ((duty_cycle - (uint32_t)(pwm)) > (uint32_t)BSP_PWR_DCDC_MIN_PWM_VALUE)
          {
            duty_cycle -= (uint32_t)ABS(pwm);
          }
          else
          {
            /* Error case: Go back to 5V or 0V and break? */
          }
        }

        pwm_step_current = duty_cycle;

        if (    (ABS((int16_t)pwm_step_current-(int16_t)pwm_step_previous) <= BSP_PWR_DCDC_MIN_PWM_STEP)
             && ((ABS(((int32_t)vbus_measured - (int32_t)vbus_previous))) <= BSP_PWR_DCDC_PRECISION)
             && (ABS(vbus_error) <= Precision))

        {
          nb_pll_loop++;
        }
        else
        {
          nb_pll_loop = 0;
        }
      } while (nb_pll_loop < 1);

      /* save the PWM value for the next settings */
      switch (VBusInmV)
      {
      case VBUS_VOLTAGE_0V_IN_MV:
        break;
      case VBUS_VOLTAGE_5V_IN_MV:
        aPWMDutyCycleLUT[VBUS_5_V]  = duty_cycle;
        aPWMDutyCalibrated[VBUS_5_V] = 1;
        break;
      case VBUS_VOLTAGE_9V_IN_MV:
        aPWMDutyCycleLUT[VBUS_9_V]  = duty_cycle;
        aPWMDutyCalibrated[VBUS_9_V] = 1;
        break;
      case VBUS_VOLTAGE_15V_IN_MV:
        aPWMDutyCycleLUT[VBUS_15_V] = duty_cycle;
        aPWMDutyCalibrated[VBUS_15_V] = 1;
        break;
      case VBUS_VOLTAGE_18V_IN_MV:
        aPWMDutyCycleLUT[VBUS_18_V] = duty_cycle;
        aPWMDutyCalibrated[VBUS_18_V] = 1;
        break;
      default:
        aPWMDutyCycleLUT[VBUS_PPS_V] = duty_cycle;
#if _PPS==USBPD_TRUE
        if (VBusInmV <= 5900)
        {
          int32_t _diff_duty_cycle;
          uint32_t _index;
          _diff_duty_cycle = duty_cycle - aPWMDutyCycleLUT_PPS[(VBusInmV - 3300) / 20];
          /* Calibrate the other values */
          for (_index = 0; _index < PWM_MAX_VALUES_LUT_PPS; _index++)
            aPWMDutyCycleLUT_PPS[_index] += _diff_duty_cycle;
          aPWMDutyCycleLUT_PPS[(VBusInmV - 3300) / 20]   = duty_cycle;
          aPWMDutyCalibrated_PPS[(VBusInmV - 3300) / 20] = duty_calibrated;
        }
#endif /* _PPS */
        break;
      }
    }
  }
  else
  {
    _retr = PWR_ERROR;
  }

  return _retr;
}

/**
 * @brief  Force the VBUS discharge.
 * @param  PortId Type-C port identifier
 *         This parameter can be take one of the following values:
 *         @arg TYPE_C_PORT_1
 * @param  VbusStopInmV Low VBUS threshold (in mV)
 * @param  VbusErrorInmV VBUS margin (in mV)
 * @param  Delay Discharge delay (in ms)
 * @retval None
 */
static void PWR_VBUSDischarge(uint32_t PortId,
                           uint32_t VbusStopInmV,
                           uint32_t VbusErrorInmV,
                           uint16_t Delay)
{
/* USER CODE BEGIN BSP_PWR_VBUSDischarge */
  uint32_t vbus;
  uint8_t vbus_disable = 0;

  if (PortId == TYPE_C_PORT_1)
  {

    PWR_GPIO_On(GPIO_VBUS_DISCHARGE1);
    /* Disable DCDC_EN bit*/
    PWR_GPIO_Off(GPIO_V_CTL2);

    /* Wait Tempo or Voltage level */
    if (Delay > 0)
    {
      HAL_Delay(Delay);
    }
    else /* if (VbusErrorInmV > 0) */
    {

      do{
        HAL_Delay(1);
        (void)BSP_USBPD_PWR_VBUSGetVoltage(PortId, &vbus);
        if ((0 == vbus_disable) && (vbus < 5000))
        {
          /* Switch off VBUS */
          PWR_GPIO_Off(GPIO_SOURCE_EN);
          vbus_disable = 1;
        }
      } while(vbus >= (VbusStopInmV + VbusErrorInmV));
    }

    /* Enable DCDC_EN bit*/
    PWR_GPIO_On(GPIO_V_CTL2);
    PWR_GPIO_Off(GPIO_VBUS_DISCHARGE1);
    /* Allow to restart with correct duty cycle */
    PWR_SetPWMDutyCycle(aPWMDutyCycleLUT[VBUS_5_V]);
  }
/* USER CODE END BSP_PWR_VBUSDischarge */
}

/* USER CODE END POWER_Private_Functions */

/**
  * @}
  */

/**
  * @}
  */

/**
  * @}
  */

